<a href="https://colab.research.google.com/github/l-longo/neural-network-crash-course/blob/main/TA_Intro_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Pandas
[Pandas](https://pandas.pydata.org/) is a package for data analysis and pre-processing in python. It is a flexible and easy-to-use manipolation tool built on Python programming language. Here the arrays are identified with labels rather than integers.

In [ ]:
import pandas as pd
print(pd.__version__)

1.1.5

We imported pandas and printed the version we will use. Note that you may have to first install it if you use jupyter or other python console. You can do this with the command `pip install pandas`.

This tutorial is meant to introduce you to the pandas library, by giving insights on the basic functions following the official [User Guide](https://pandas.pydata.org/docs/user_guide/10min.html#object-creation) which you are supposed to check in order to have a more defined knowledge of the library.

In [ ]:
import numpy as np

Pandas usage is closely related to the ones of NumPy. That is why we also import the library.

##Object creation
From a list of values we can create a series with pandas library. This will automatically index the sequence:

In [ ]:
series = pd.Series([1, 3, 5, np.nan, 6, 8])
print(series)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

A `Series` is a single-dimensional array containing a list of values indexed (in this case indexed with integers).

In [ ]:
print(series[0])

1.0

In [ ]:
print(series[2:])

2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

We can access element of the series in a similar way of NumPy arrays.

We can create series by specifying index as a list of strings

In [ ]:
s = pd.Series([10, 8, 3, 2, 2, 7, 6, 10, 9, 4], 
              index=['zero', 'one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight', 'nine'])

print(s)

zero     10
one       8
two       3
three     2
four      2
five      7
six       6
seven    10
eight     9
nine      4
dtype: int64

In [ ]:
s.two

3

the `iloc` command is another way to access elements:

In [ ]:
s.iloc[0]

10

This is another way to access values in a series.

##Dictionaries and series
We can convert a dictionary into a series:

In [ ]:
dict0 = {'Mercedes': 60, 'Audi': 20, 'Jeep': 50, 'Renault': 40}
print(dict0)
print('\n')
print(pd.Series(dict0))

{'Mercedes': 60, 'Audi': 20, 'Jeep': 50, 'Renault': 40}


Mercedes    60
Audi        20
Jeep        50
Renault     40
dtype: int64

##Dataframe
A `dataframe` can be seen as a rectangular table of data. Similar to a 2-D array, a dataframe has rows and columns labelled with integers or strings. Unlike a numpy array, a dataframe can handle different data-type.

In [ ]:
heights = [1.68, 1.70, 1.65, 1.80, 1.78]
GPA = [4.0, 3.7, 3.9, 3.1, 3.5]
c=np.array([heights, GPA]).T
df = pd.DataFrame(c,
                  columns=['heights', 'GPA'],
                  index=['Elisabeth', 'Ilary', 'Mark', 'Bob', 'Peter'])

print(c.dtype)
print(df)

float64
           heights  GPA
Elisabeth     1.68  4.0
Ilary         1.70  3.7
Mark          1.65  3.9
Bob           1.80  3.1
Peter         1.78  3.5

With the above code we created a 2-D array with heights and GPA of some imaginary students. With the command `pd.dataframe` we can convert the array in a dataframe with labels for rows and columns.

With the command `to_numpy()` we can get the original array:

In [ ]:
print(df.to_numpy())

[[1.68 4.  ]
 [1.7  3.7 ]
 [1.65 3.9 ]
 [1.8  3.1 ]
 [1.78 3.5 ]]

The same as $c$:

In [ ]:
print(c)

[[1.68 4.  ]
 [1.7  3.7 ]
 [1.65 3.9 ]
 [1.8  3.1 ]
 [1.78 3.5 ]]

###Insert columns
After a dataframe is created we can use functions to insert new columns. Let's say that we want to insert a column with the hair's color of the students. In this case we have a list of strings:

In [ ]:
color = ['red', 'brown', 'brown', 'blonde', 'brown']

and we use the command `insert` in which we specify the column index, the name of the new column and the value:

In [ ]:
df.insert(loc=2,column='color',value=color)
print(df)

           heights  GPA   color
Elisabeth     1.68  4.0     red
Ilary         1.70  3.7   brown
Mark          1.65  3.9   brown
Bob           1.80  3.1  blonde
Peter         1.78  3.5   brown

###Access elements in dataframe

Accessing elements in a dataframe is similar as for series, we can access horizzontally and vertically. We access the column in the same way of series:

In [ ]:
print(df.GPA)
print('\n')
print(df.heights)

Elisabeth    4.0
Ilary        3.7
Mark         3.9
Bob          3.1
Peter        3.5
Name: GPA, dtype: float64


Elisabeth    1.68
Ilary        1.70
Mark         1.65
Bob          1.80
Peter        1.78
Name: heights, dtype: float64

Or you can access elements by selecting the row:

In [ ]:
print(df.iloc[1])

heights      1.7
GPA          3.7
color      brown
Name: Ilary, dtype: object

In [ ]:
print(df.iloc[1:])

       heights  GPA   color
Ilary     1.70  3.7   brown
Mark      1.65  3.9   brown
Bob       1.80  3.1  blonde
Peter     1.78  3.5   brown

### Working with NaN

Dataframe can easily handle NaN values. Let's make an example:

In [ ]:
df

           heights  GPA   color
Elisabeth     1.68  4.0     red
Ilary         1.70  3.7   brown
Mark          1.65  3.9   brown
Bob           1.80  3.1  blonde
Peter         1.78  3.5   brown

In [ ]:
print(df.iloc[2,1])

3.9

with the function iloc we access the third row of column GPA, which is the one of Mark (note that the function iloc allows to access dataframe the same way we can access 2-D array). We change this value to a NaN:

In [ ]:
df.iloc[2,1] = np.nan
print(df)

           heights  GPA   color
Elisabeth     1.68  4.0     red
Ilary         1.70  3.7   brown
Mark          1.65  NaN   brown
Bob           1.80  3.1  blonde
Peter         1.78  3.5   brown

The Nan value can be handled in different ways. The more brutal solution is to delete the rows with a NaN:

In [ ]:
df.dropna()

           heights  GPA   color
Elisabeth     1.68  4.0     red
Ilary         1.70  3.7   brown
Bob           1.80  3.1  blonde
Peter         1.78  3.5   brown

or we can fill it with a value:

In [ ]:
df.fillna(0)

           heights  GPA   color
Elisabeth     1.68  4.0     red
Ilary         1.70  3.7   brown
Mark          1.65  0.0   brown
Bob           1.80  3.1  blonde
Peter         1.78  3.5   brown

we can fill it with 0 or with a value of one of the colleagues:

In [ ]:
df.fillna(df.iloc[1,1])

           heights  GPA   color
Elisabeth     1.68  4.0     red
Ilary         1.70  3.7   brown
Mark          1.65  3.7   brown
Bob           1.80  3.1  blonde
Peter         1.78  3.5   brown

the way we handle NaN is closely related to the application or the dataset. If we have a time series we may want to linearly interpolate:

In [ ]:
df.interpolate()

           heights  GPA   color
Elisabeth     1.68  4.0     red
Ilary         1.70  3.7   brown
Mark          1.65  3.4   brown
Bob           1.80  3.1  blonde
Peter         1.78  3.5   brown

We can also detect missing values with functions `isna()`, `isnull()`:

In [ ]:
print(df.isna())
print('\n')
print(df.isnull())

           heights    GPA  color
Elisabeth    False  False  False
Ilary        False  False  False
Mark         False   True  False
Bob          False  False  False
Peter        False  False  False


           heights    GPA  color
Elisabeth    False  False  False
Ilary        False  False  False
Mark         False   True  False
Bob          False  False  False
Peter        False  False  False

##Pandas datareader

There are many functions within the Pandas framework and you can find a broader view in the official guidelines. We will now see how to import data from external websites using the pandas data reader.

In [ ]:
import pandas_datareader as pdr

We will get data from [Fred](https://fred.stlouisfed.org/), a public websites with official macroeconomic releases and financial variables. Let's firstly define string of dates for the period that we want:

In [ ]:
os='1959-01-01'
oe=pd.Timestamp("today").strftime("%Y-%m-%d")
print(os)
print(oe)

1959-01-01
2021-05-27

In [ ]:
gdp = pdr.get_data_fred('A191RP1Q027SBEA', start=os, end=oe)
gdp

            A191RP1Q027SBEA
DATE
1959-01-01              8.9
1959-04-01             10.0
1959-07-01              1.8
1959-10-01              2.7
1960-01-01             11.1
...                     ...
2020-01-01             -3.4
2020-04-01            -32.8
2020-07-01             38.3
2020-10-01              6.3
2021-01-01             10.7

[249 rows x 1 columns]

We just collected a dataframe of the US GDP quarterly percent change by using the appropriate FRED code. Therefore the command returns a dataframe with date as index. 

###Create a dataset
We now create a dataframe with more macroeconomic releases:

In [ ]:
df = {}
#Quarterly variables:
df['GDP'] = pdr.get_data_fred('A191RP1Q027SBEA', start=os, end=oe).iloc[:,0] #GDP
df['M1V'] = pdr.get_data_fred('M1V', start=os, end=oe).iloc[:,0] #money 1 velocity
df['M2V'] = pdr.get_data_fred('M2V', start=os, end=oe).iloc[:,0] #money 2 velocity
#Monthly variables:
df['Unemp'] = pdr.get_data_fred('UNRATE', start=os, end=oe).iloc[:,0] #measure of unemployment
df['infl'] = pdr.get_data_fred('CPIAUCSL', start=os, end=oe).iloc[:,0] #CPI
df['un'] = pdr.get_data_fred('UNEMPLOY', start=os, end=oe).iloc[:,0] #another measure of unemployment
df = pd.DataFrame(df)

df_weekly = {}
#weekly variables:
df_weekly['claims'] = pdr.get_data_fred('ICSA', start=os, end=oe).iloc[:,0] #initial claims
df_weekly = pd.DataFrame(df_weekly)

df = df[df.index<"2021-02-01"]
df_weekly = df_weekly[df_weekly.index<"2021-02-01"]

In this code we defined two dataframes by combining monthly and quarterly variables in df and a weekly variable in df_weekly. We also keep an upper bound for the index in order to meet the last official release of GDP.

In [ ]:
df

             GDP    M1V    M2V  Unemp     infl     un
DATE
1959-01-01   8.9  3.663  1.773    6.0   29.010   4068
1959-02-01   NaN    NaN    NaN    5.9   29.000   3965
1959-03-01   NaN    NaN    NaN    5.6   28.970   3801
1959-04-01  10.0  3.719  1.789    5.2   28.980   3571
1959-05-01   NaN    NaN    NaN    5.1   29.040   3479
...          ...    ...    ...    ...      ...    ...
2020-09-01   NaN    NaN    NaN    7.8  260.149  12535
2020-10-01   6.3  1.221  1.135    6.9  260.462  11049
2020-11-01   NaN    NaN    NaN    6.7  260.927  10728
2020-12-01   NaN    NaN    NaN    6.7  261.560  10736
2021-01-01  10.7  1.198  1.123    6.3  262.231  10130

[745 rows x 6 columns]

In df we combine variables at different frequencies. You can recognize the quarterly variables because they have NaN every pair of months between the official release.

In [ ]:
df_weekly

            claims
DATE
1967-01-07  208000
1967-01-14  207000
1967-01-21  217000
1967-01-28  204000
1967-02-04  216000
...            ...
2021-01-02  781000
2021-01-09  904000
2021-01-16  886000
2021-01-23  836000
2021-01-30  837000

[2822 rows x 1 columns]

We now aggregate by averaging consecutive 4 weekly claims in order to get a monthly measure. This is a technique you would like to master if you work with time series data:

In [ ]:
claims = np.zeros(705)

for i in range(705):
    claims[i] = np.mean(df_weekly.iloc[i*4:i*4+4])


a = np.empty(40)
a[:] = np.nan

claims_data = np.hstack((a,claims))

and then we insert in the original dataframe:

In [ ]:
df.insert(loc=6, column='claims', value = claims_data)
df

             GDP    M1V    M2V  Unemp     infl     un    claims
DATE
1959-01-01   8.9  3.663  1.773    6.0   29.010   4068       NaN
1959-02-01   NaN    NaN    NaN    5.9   29.000   3965       NaN
1959-03-01   NaN    NaN    NaN    5.6   28.970   3801       NaN
1959-04-01  10.0  3.719  1.789    5.2   28.980   3571       NaN
1959-05-01   NaN    NaN    NaN    5.1   29.040   3479       NaN
...          ...    ...    ...    ...      ...    ...       ...
2020-09-01   NaN    NaN    NaN    7.8  260.149  12535  851000.0
2020-10-01   6.3  1.221  1.135    6.9  260.462  11049  795250.0
2020-11-01   NaN    NaN    NaN    6.7  260.927  10728  746750.0
2020-12-01   NaN    NaN    NaN    6.7  261.560  10736  812000.0
2021-01-01  10.7  1.198  1.123    6.3  262.231  10130  833500.0

[745 rows x 7 columns]

We created a dataframe combining quarterly, monthly and weekly variables. We can combine any time frequency with these techniques.

In the next line of code we will implement a *quarterly log difference* (using numpy functions) over the columns of df, except for GDP that already represents a quarterly change:

In [ ]:
def diff_quart(x):
    return np.log(x[3:]) - np.log(x[:-3])
dff = df.to_numpy()
data = np.zeros((df.shape[0]-3,df.shape[1]))
for k in range(df.shape[1]):
    data[:,k] = diff_quart(dff[:,k])

df_final = pd.DataFrame(data, columns=list(df.columns), index=df.index[3:])
df_final.GDP = df.GDP.iloc[3:]

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: RuntimeWarning: invalid value encountered in log

In [ ]:
df_final

             GDP       M1V       M2V     Unemp      infl        un    claims
DATE
1959-04-01  10.0  0.015172  0.008984 -0.143101 -0.001035 -0.130306       NaN
1959-05-01   NaN       NaN       NaN -0.145712  0.001378 -0.130761       NaN
1959-06-01   NaN       NaN       NaN -0.113329  0.004821 -0.102996       NaN
1959-07-01   1.8 -0.002423 -0.008984 -0.019418  0.005849 -0.012115       NaN
1959-08-01   NaN       NaN       NaN  0.019418  0.004809  0.030850       NaN
...          ...       ...       ...       ...       ...       ...       ...
2020-09-01   NaN       NaN       NaN -0.352821  0.011082 -0.344870 -0.527027
2020-10-01   6.3 -0.021872 -0.011389 -0.390866  0.007159 -0.389316 -0.487995
2020-11-01   NaN       NaN       NaN -0.226124  0.005442 -0.232939 -0.172678
2020-12-01   NaN       NaN       NaN -0.152016  0.005409 -0.154922 -0.046912
2021-01-01  10.7 -0.019017 -0.010629 -0.090972  0.006769 -0.086839  0.046977

[742 rows x 7 columns]

##Conclusion

After this tutorial you learned about the basic concept of Pandas and you should be able to manage the programming of neural networks in Keras. For a more complete knowledge you can look at the official guideline.